# Cross-platform make
brew "cmake"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12", link: false
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast web fuzzer written in Go
brew "ffuf"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU compiler collection
brew "gcc@11"
# Distributed revision control system
brew "git"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Platform built on V8 to build network applications
brew "node"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Multi-media library with bindings for multiple languages
brew "sfml"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# App to build and share containerised applications and microservices
cask "docker"
# Web browser
cask "firefox@developer-edition"
cask "font-meslo-lg-nerd-font"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# System monitor for the menu bar
cask "stats"
# Text editor for code, markup and prose
cask "sublime-text"
# Compatibility layer to run Windows applications
cask "wine-stable"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "akamud.vscode-javascript-snippet-pack"
vscode "austenc.tailwind-docs"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dart-code.dart-code"
vscode "dbaeumer.vscode-eslint"
vscode "divyanshuagrawal.competitive-programming-helper"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "formulahendry.auto-rename-tag"
vscode "fosshaas.fontsize-shortcuts"
vscode "frhtylcn.pythonsnippets"
vscode "github.codespaces"
vscode "hars.cppsnippets"
vscode "hoovercj.vscode-power-mode"
vscode "infarkt.css-to-jss"
vscode "kaysonwu.cpptask"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-cs"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-ceintl.vscode-language-pack-es"
vscode "ms-ceintl.vscode-language-pack-fr"
vscode "ms-ceintl.vscode-language-pack-it"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-ceintl.vscode-language-pack-pl"
vscode "ms-ceintl.vscode-language-pack-pt-br"
vscode "ms-ceintl.vscode-language-pack-ru"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-ceintl.vscode-language-pack-zh-hant"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "nash.awesome-flutter-snippets"
vscode "otovo-oss.htmx-tags"
vscode "paulmolluzzo.convert-css-in-js"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "svelte.svelte-vscode"
vscode "twxs.cmake"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "vunguyentuan.vscode-postcss"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
